spam = 42
cheese = spam
spam = 100

print(spam)     # 100
print(cheese)   # 42
''' тобто це різні змінні з різними значеннями '''
# але присвоюючи змінній список - ви насправді присвоюєте
# посилання на цей список! тобто:

spam = [i for i in range(5)]
cheese = spam
cheese[1] = 'Hello!'

print(cheese)   # [0, 'Hello!', 2, 3, 4]
print(spam)     # [0, 'Hello!', 2, 3, 4]

'''
створюючи список, ви присвоюєте посилання на нього змінній spam.
у наступному рядку в змінну cheese копіюється не сам список,
а посилання на нього, що зберігається в змінній spam.
Це означає, що і spam, і cheese посилаються на один і той
самий список. Тобто список існує в єдиному екземплярі і
він нікуди не копіювався!
Змінні містять посилання на списки, а не самі списки.
Однак у випадку рядків та цілих чисел змінні містять
безпосередньо самі рядкові й цілочисельні значення.
Python завжди використовує посилання в тих випадках,
коли у змінних мають зберігатися змінювані типи даних,
такі як списки або словники.
У випадку незмінюваних типів даних,
таких як рядки, цілі числа або кортежі,
у змінних Python зберігаються самі значення.

Незважаючи на те, що з технічної точки зору
у змінних Python зберігаються лише посилання на списки
та словники, часто просто говорять, що змінна містить список
або словник.
'''
