# ПЕРЕДАЧА ПОСИЛАНЬ (ЛІНКІВ)
'''Посилання особливо важливі для розуміння механізму
передачі аргументів функціям. Коли викликається функція,
значення аргументів копіюються у змінні параметрів.
Для списків (і словників, про які йтиметься в наступному
розділі) це означає, що параметри використовують посилання.
Щоб побачити, до яких наслідків це призводить,
введіть наступний код і збережіть його у файлі passingReference.py.
'''
def eggs(someParameter):
    someParameter.append('Hello')

spam = [1, 2, 3]
eggs(spam)
print(spam)

'''Зверніть увагу на те, що присвоєння нового значення
змінній spam здійснюється не за рахунок використання
значення, яке повертається викликом eggs().
Замість цього список змінюється безпосередньо на місці.
Запустивши цю програму, ви отримаєте наступний вивід:

[1, 2, 3, 'Hello']

Попри те, що змінні spam і someParameter містять
окремі посилання, обидві вони посилаються на один
і той самий список. Ось чому виклик методу append('Hello')
у функції впливає на список навіть після того,
як було виконано вихід із функції.

Майте на увазі, що необережність щодо того,
як Python обробляє змінні, у яких зберігаються списки
чи словники, може призвести до появи найнесподіваніших
помилок.'''

# Висновок
# Для незмінюваних типів (числа, рядки, кортежі)
# зміни створюють новий об’єкт.

# Для змінюваних типів (списки, словники, множини)
# зміни відбуваються на місці, і всі змінні-посилання це побачать.